{
  "LazyVim": { "branch": "main" },
  "LazyVim-starter": { "branch": "main" },
  "SchemaStore.nvim": { "branch": "main" },
  "Trans.nvim": { "branch": "v2" },
  "addyosmani-agent-skills": { "branch": "main" },
  "agent-stuff": { "branch": "main" },
  "async.nvim": { "branch": "main" },
  "baleia.nvim": { "branch": "main" },
  "better-escape.nvim": { "branch": "master" },
  "blink-cmp-dat-word": { "branch": "main" },
  "blink-ripgrep.nvim": { "branch": "main" },
  "blink.cmp": { "branch": "main" },
  "blink.lib": { "branch": "main" },
  "bookmarks.yazi": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
  "caps-word.nvim": { "branch": "main" },
  "catppuccin": { "branch": "main" },
  "chezmoi.nvim": { "branch": "main" },
  "chezmoi.vim": { "branch": "main" },
  "claude-code-sourcemap": { "branch": "main" },
  "codecompanion-history.nvim": { "branch": "main" },
  "codecompanion-spinner.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "coerce.nvim": { "branch": "main" },
  "colorful-menu.nvim": { "branch": "master" },
  "conform.nvim": { "branch": "master" },
  "conjure": { "branch": "main" },
  "coop.nvim": { "branch": "main" },
  "crates.nvim": { "branch": "main" },
  "csgithub.nvim": { "branch": "master" },
  "csvview.nvim": { "branch": "main" },
  "curl.nvim": { "branch": "main" },
  "cyberdream.nvim": { "branch": "main" },
  "dannote-dot-pi": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "dropbar.nvim": { "branch": "master" },
  "flash.nvim": { "branch": "main" },
  "flatten.nvim": { "branch": "main" },
  "folke-dot": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "google-10000-english": { "branch": "master" },
  "grug-far.nvim": { "branch": "main" },
  "helpview.nvim": { "branch": "main" },
  "herdr": { "branch": "master" },
  "http.nvim": { "branch": "main" },
  "kitty-scrollback.nvim": { "branch": "main" },
  "layers.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "live-rename.nvim": { "branch": "main" },
  "log-highlight.nvim": { "branch": "main" },
  "lua-console.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lock.nvim": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mattpocock-skills": { "branch": "main" },
  "mini-git": { "branch": "main" },
  "mini.ai": { "branch": "main" },
  "mini.align": { "branch": "main" },
  "mini.diff": { "branch": "main" },
  "mini.files": { "branch": "main" },
  "mini.hipatterns": { "branch": "main" },
  "mini.icons": { "branch": "main" },
  "mini.operators": { "branch": "main" },
  "mini.pairs": { "branch": "main" },
  "mini.snippets": { "branch": "main" },
  "mini.surround": { "branch": "main" },
  "mini.trailspace": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neogen": { "branch": "main" },
  "neon.nvim": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-python": { "branch": "master" },
  "neovim": { "branch": "master" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "numb.nvim": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-python": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-jdtls": { "branch": "master" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-metals": { "branch": "main" },
  "nvim-nio": { "branch": "master" },
  "nvim-origami": { "branch": "main" },
  "nvim-paredit": { "branch": "master" },
  "nvim-rip-substitute": { "branch": "main" },
  "nvim-treesitter": { "branch": "main" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "main" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-various-textobjs": { "branch": "main" },
  "obscure.nvim": { "branch": "main" },
  "oh-my-tmux": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "onedark.nvim": { "branch": "master" },
  "pantran.nvim": { "branch": "main" },
  "persistence.nvim": { "branch": "main" },
  "pi": { "branch": "main" },
  "pi-agent-colony": { "branch": "main" },
  "pi-copilot-advanced": { "branch": "main" },
  "pi-guardrails": { "branch": "main" },
  "pi-invisible-continue": { "branch": "main" },
  "pi-listen": { "branch": "main" },
  "pi-mcp-adapter": { "branch": "main" },
  "pi-neuralwatt-provider": { "branch": "main" },
  "pi-retry": { "branch": "main" },
  "pi-vim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "ponytail": { "branch": "main" },
  "ppt-master": { "branch": "main" },
  "py-requirements.nvim": { "branch": "main" },
  "refactoring.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "rustaceanvim": { "branch": "master" },
  "sidekick.nvim": { "branch": "main" },
  "smart-splits.nvim": { "branch": "master" },
  "smart-translate.nvim": { "branch": "main" },
  "snacks.nvim": { "branch": "main" },
  "spring-boot.nvim": { "branch": "main" },
  "sqlite.lua": { "branch": "master" },
  "starship.yazi": { "branch": "main" },
  "store.nvim": { "branch": "main" },
  "text-case.nvim": { "branch": "main" },
  "time-machine.nvim": { "branch": "main" },
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
  "tmux.nvim": { "branch": "main" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "ts-comments.nvim": { "branch": "main" },
  "undo-glow.nvim": { "branch": "main" },
  "venv-selector.nvim": { "branch": "main" },
  "vim-asterisk": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "visimatch.nvim": { "branch": "main" },
  "wezterm-types": { "branch": "main" },
  "wezterm.nvim": { "branch": "main" },
  "which-key.nvim": { "branch": "main" },
  "yanky.nvim": { "branch": "main" },
  "yazi-flavors": { "branch": "main" },
  "yazi-plugins": { "branch": "main" },
  "yazi.nvim": { "branch": "main" }
}
